# Data Science Tools

In [1]:
import pandas as pd
import numpy as np
dat = pd.read_csv('titanic.csv')

In [2]:
dat.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
#loc and iloc

In [4]:
dat.loc[:,['Survived','Sex']].head()

   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

In [5]:
dat.iloc[:,[1,3]].head()

   Survived                                               Name
0         0                            Braund, Mr. Owen Harris
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1                             Heikkinen, Miss. Laina
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0                           Allen, Mr. William Henry

In [6]:
#encoding
dat['Sex_Numeric']=dat["Sex"].map({"female": 1, "male": 0})

In [7]:
#Percentage of female
dat['Sex_Numeric'].sum()/dat['Sex_Numeric'].count()

0.35241301907968575

In [8]:
dat['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [9]:
# Get the ceiling of fare
dat['Fare_ceil'] = np.ceil(dat['Fare'])
dat['Fare_ceil'].head()

0     8.0
1    72.0
2     8.0
3    54.0
4     9.0
Name: Fare_ceil, dtype: float64

In [10]:
dat['Fare_ceil'] = dat['Fare'].apply(np.ceil)
dat['Fare_ceil'].head()

0     8.0
1    72.0
2     8.0
3    54.0
4     9.0
Name: Fare_ceil, dtype: float64

In [11]:
drinks = pd.read_csv('drinks.csv')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [12]:
max_beer = max(drinks.beer_servings)
max_beer

376

In [13]:
max_spirit = max(drinks.spirit_servings)
max_spirit

438

In [14]:
max_wine = max(drinks.wine_servings)
max_wine

370

In [15]:
#max for alchohol
drinks.iloc[:, 1:4].apply(max, axis = 0)

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [16]:
#max for each continent
max_each = drinks.groupby('continent')['beer_servings'].max()
max_each.head()

continent
Africa           376
Asia             247
Europe           361
North America    285
Oceania          306
Name: beer_servings, dtype: int64

In [17]:
max_each = drinks.groupby('continent').agg({'beer_servings':'max'})
max_each.head()

               beer_servings
continent
Africa                   376
Asia                     247
Europe                   361
North America            285
Oceania                  306

In [18]:
# the max sales type of the alchohol for each country
drinks.iloc[:, 1:4].apply(np.argmax, axis = 1).head()

d:\Anaconda3\lib\site-packages\numpy\core\fromnumeric.py:56: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  return getattr(obj, method)(*args, **kwds)

0      beer_servings
1    spirit_servings
2      beer_servings
3      wine_servings
4      beer_servings
dtype: object